Love4yzp/tvoc-sensors-indicator/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.x Project Minimal Configuration


CONFIG_IDF_TARGET="esp32s3"


CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y


CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# CONFIG_ESP32S3_DATA_CACHE_64KB=y
# CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# CONFIG_ESP_IPC_TASK_STACK_SIZE=4096

# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=n
# CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND=n
# CONFIG_ESP_PHY_REDUCE_TX_POWER=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000


CONFIG_FREERTOS_HZ=1000
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Reboot instead of freezing forever when a task (e.g. taskLVGL) stops
# resetting the watchdog — a hung UI must recover on its own in the field.
CONFIG_ESP_TASK_WDT_PANIC=y

# Dump all task stacks to the UART on panic (blocked-task backtraces, e.g. a
# frozen taskLVGL, are not visible any other way). Decode with espcoredump.py.
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y


CONFIG_LCD_AVOID_TEAR=y
CONFIG_LCD_LVGL_FULL_REFRESH=y
CONFIG_LCD_TASK_REFRESH_TIME=10
CONFIG_LV_DEF_REFR_PERIOD=10


# CONFIG_LV_CONF_MINIMAL=y
CONFIG_LV_MEM_CUSTOM=y
# Raise LVGL TLSF max pool size (default = LV_MEM_SIZE) so the 256 KB PSRAM
# overflow pool added in main/ui/ui_mem_pool.c is accepted by lv_mem_add_pool.
CONFIG_LV_MEM_POOL_EXPAND_SIZE_KILOBYTES=256
# CONFIG_LV_MEMCPY_MEMSET_STD=y
# CONFIG_LV_USE_ASSERT_NULL=y
# CONFIG_LV_USE_ASSERT_MALLOC=y
# CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y

CONFIG_LV_FONT_UNSCII_8=n
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LV_SPRINTF_USE_FLOAT=y
